# დავალება 1
# input-შემავალი ინფორმაცია
# output-გამომავალი ინფორმაცია

# დავალება 2
# კონკაცინაცია არის მოვლენა როდესაც სტრინგები ერთმანეთს ემატება

#დავალება 3
num1="2"
num2=3
print(int(num1)+num2)
print(int(num1)-num2)
print(int(num1)/num2)
print(int(num1)//num2)
print(int(num1)*num2)
print(num1*num2)

#დავალება 4
#dataconvertionარის მოვლენა,რომლის დროსაც ერთი ტიპის მონაცემს გადავაქცევთ მეორე ტიპის მონაცემად.

#დავალება 5
#implicit/implicitly- მონაცემთ ტიპი ავტომატურად იცვლება
#explicit/explicitly-მონაცემთ ტიპს ვცვლით ხელით
#str()-მას გადაყავს მონაცემი სტრინგად
#int()-მას გადაყავს მონაცემი ინტეჯერად ანუ მთელ რიცხვად
#float()-მას გადაყავს მონაცემი float-ად ანუ წილად რიცხვად