

#string/str არის ნებისმიერი რამ რაც ბრჭყალებშია მოქცეული. მაგალითად:
print("tekla")

#integer/int არის მთელ რიცხვთ მონაცემთა ტიპი. მაგალითად:(200,300,1000,3,2,4) და ასე შემდეგ

#float არის წილად რიცხვთა მონაცემთა ტიპი. მაგალითად :(5,1. 3,0. 1.99)


 #print არის იგივე დაბეჭდვა. ესაა ფუნქცია რომელსაც გადავცემთ მონაცემს და კოდის გაშვების შემდეგ ეს მონაცემი დაიბეჭდება ტერმინალში.



print("tekla mchedlidze")
print("16")

#vireables არის ცვლადი,მას ვიყენებთ მონაცემების შესანახად და ადვილად ამოსაყენებლად


name="tekla"
surname="mchedlidze"

print(name)
print(surname)