#დავალება 1

#flowchart-მარტივი გზა გამოვსახოთ ალგორითმი ფოტოს სახით/მოვახდინოტ მისი ვიზუალიზაცია
#algoritm-ალგორითმი რაღაც ნაბიჟების ერთობლიობაა,რომელიც საბოლოოდ ასრულებს რაღაც დავალებას.
#ნაბიჯები სრულდება იმ თანმიმდევრობით როგორც არის დაწერილი
#natural language- კოდის აღწერა სიტყვიერად
#pseudocode-სიტყვიერად ალგორითმის აღწერა სადაც შერეულია ცოტა პროგრამირების ენის სინტაქსი

#დავალება 2

#sequence-თანმიმდევრობით დაბეჭდვა
#მაგალითად:
print(1)
print(2)
print(3)
print(4)
print(5)

#დავალება 3

#iteration-ინსტრუქციის გამეორება
#მაგალითად:
for i in range(1,30,3):
    print(i)

#დავალება 4

#selection-არჩვითი(არჩევს პროგრამა რომელი კოდი უნდა შეასრულოს მოცემული პირობების მიხედვით)
#მაგალითად:
#შენ ხარ კარიის წინ.
#კარზე აწერია: „შესვლა მხოლოდ მათთვის, ვინც 18 წლის ან მეტია.“
#თუ ხარ 18 წლის ან მეტი შეხვალ შენობაში
#თუ ხარ 18-ზე ნაკლები გეტყვიან, რომ არ შეგიძლია შესვლა